[
    {
        "title": "Profit Pulse",
        "frameworks": "React, Javascript, CSS, Python, TensorFlow, Node.js, Git",
        "date": "July 2024",
        "icon": "project1",
        "points": [
            "A web application where traders can input their data to receive Reorder Point (ROP), Return on Investment (ROI), and Stock analysis using an ML model.",
            "Integrated the client-side with the model through APIs.",
            "Developed features for data input, real-time analysis, and user authentication using Firebase for secure access."
        ],
        "githubLink": "https://github.com/SupratitDatta/Profit-Pulse"
    },
    {
        "title": "Novel Net",
        "frameworks": "React Native, TypeScript, TailwindCSS, Expo, Git",
        "date": "June 2024",
        "icon": "project2",
        "points": [
            "An online book app where users can read books, explore a variety of genres, and add them to their favorites.",
            "Implemented an intuitive book browsing feature that increased user engagement by enabling seamless navigation through 100+ titles.",
            "Developed a favorites management system for personalized experiences."
        ],
        "githubLink": "https://github.com/SupratitDatta/Novel-Net"
    },
    {
        "title": "Pristine",
        "frameworks": "React, TypeScript, SCSS, Node.js, Express.js, MongoDB, Firebase, Leaflet, Git",
        "date": "May 2024",
        "icon": "project3",
        "points": [
            "A Real Estate website that allows users to browse a variety of properties (50+) available for rent or purchase.",
            "Users can log in using integrated Firebase Authentication, select properties, view details and images, explore maps, and post their own listings."
        ],
        "githubLink": "https://github.com/SupratitDatta/Pristine"
    },
    {
        "title": "Tech Trove",
        "frameworks": "Next.js, TailwindCSS, Node.js, MongoDB, NextAuth, Cloudinary, Git",
        "date": "March 2024",
        "icon": "project4",
        "points": [
            "Crafted an immersive e-commerce platform featuring a wide selection of electronic gadgets, organized into categories and sections with search filters.",
            "Integrated NextAuth for user authentication, enabling users to log in, add products to the cart, and make purchases.",
            "Created an admin panel for managing products and categories, including adding, updating, removing items, viewing orders, and checking payment status."
        ],
        "githubLink": "https://github.com/SupratitDatta"
    },
    {
        "title": "Pulse News",
        "frameworks": "React, Javascript, CSS, Git",
        "date": "January 2024",
        "icon": "project5",
        "points": [
            "An interactive website offering real-time news updates across multiple categories with accurate source and date.",
            "Includes a search bar and categorized sections for personalized, user-specific news content."
        ],
        "githubLink": "https://github.com/SupratitDatta/Pulse-News"
    },
    {
        "title": "Rail Ease",
        "frameworks": "HTML, CSS, PHP, SQL, Git",
        "icon": "project6",
        "date": "December 2023",
        "points": [
            "Developed a convenient Train Ticket booking platform where users can book, cancel, and view their tickets.",
            "An admin panel is also present for admins to add or remove any Train."
        ],
        "githubLink": "https://github.com/SupratitDatta/Rail-Ease"
    }
]